#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.api_cert will be updated in-place
  ~ resource "aws_acm_certificate" "api_cert" {
        arn                       = "arn:aws:acm:ap-southeast-1:780046271874:certificate/0523df41-1a70-470f-9873-dda83c02190b"
        domain_name               = "api.trackncovph.jclarino.com"
        domain_validation_options = [
            {
                domain_name           = "api.trackncovph.jclarino.com"
                resource_record_name  = "_b7d6e411a25c688c0d2d1d20d0084bc6.api.trackncovph.jclarino.com."
                resource_record_type  = "CNAME"
                resource_record_value = "_6305303a45b243725e49651d1168fffb.auiqqraehs.acm-validations.aws."
            },
        ]
        id                        = "arn:aws:acm:ap-southeast-1:780046271874:certificate/0523df41-1a70-470f-9873-dda83c02190b"
        subject_alternative_names = []
      ~ tags                      = {
            "Environment" = "prod"
          + "Name"        = "API Endpoint Covid Tracker"
        }
        validation_emails         = []
        validation_method         = "DNS"

        options {
            certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # aws_api_gateway_deployment.covid_tracker must be replaced
+/- resource "aws_api_gateway_deployment" "covid_tracker" {
      ~ created_date  = "2020-05-02T10:13:07Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-southeast-1:780046271874:hvw6yag8n9/prod" -> (known after apply)
      ~ id            = "qjha9v" -> (known after apply)
      ~ invoke_url    = "https://hvw6yag8n9.execute-api.ap-southeast-1.amazonaws.com/prod" -> (known after apply)
        rest_api_id   = "hvw6yag8n9"
        stage_name    = "prod"
      ~ variables     = { # forces replacement
          ~ "trigger" = "739636b561bc87b9cada6a3c95fe7964" -> "3ab462c8036259b5deeb9b68d1fba10f"
        }
    }

  # aws_api_gateway_integration.cors_integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "cors_integration" {
        cache_key_parameters = []
        cache_namespace      = "dsaox9"
        connection_type      = "INTERNET"
        http_method          = "OPTIONS"
        id                   = "agi-hvw6yag8n9-dsaox9-OPTIONS"
        passthrough_behavior = "WHEN_NO_MATCH"
        request_parameters   = {}
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        resource_id          = "dsaox9"
        rest_api_id          = "hvw6yag8n9"
        timeout_milliseconds = 29000
        type                 = "MOCK"
    }

  # aws_lambda_function.case_collection will be updated in-place
  ~ resource "aws_lambda_function" "case_collection" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:case-collection"
        filename                       = "./lambda_functions/case-collection/function.zip"
        function_name                  = "case-collection"
        handler                        = "CaseCollection::CaseCollection.LambdaEntry::RunAsync"
        id                             = "case-collection"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:case-collection/invocations"
      ~ last_modified                  = "2020-05-01T12:45:21.825+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:case-collection:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/case-collection"
        runtime                        = "dotnetcore3.1"
      ~ source_code_hash               = "wKQMKyIGEueE1QhQqYcN9sBhulJI0d0VdsOEwVPER2A=" -> "/dInDT70/ROSWBdSGwE1KgAlssQsnGE3NjTqsDcBpTs="
        source_code_size               = 1251450
        tags                           = {}
        timeout                        = 900
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "DRIVE_CONFIG_SECRET_ID"               = "googleaccesskey"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.google_verification will be updated in-place
  ~ resource "aws_lambda_function" "google_verification" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:google-verification"
        filename                       = "./lambda_functions/google-verification/function.zip"
        function_name                  = "google-verification"
        handler                        = "index.handler"
        id                             = "google-verification"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:google-verification/invocations"
      ~ last_modified                  = "2020-04-25T18:25:14.640+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:google-verification:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/google-verification"
        runtime                        = "nodejs10.x"
      ~ source_code_hash               = "vf6MMJ9yzlBCuQyvrpNtlsJQocW3ZMQ+rQSn/E3YSqY=" -> "3pk7AemI084Rz1Dyf8vlps+/3dGfl5yh/Cad3xnir+c="
        source_code_size               = 3200
        tags                           = {}
        timeout                        = 15
        version                        = "$LATEST"

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.graph will be updated in-place
  ~ resource "aws_lambda_function" "graph" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph"
        filename                       = "./lambda_functions/graph-node/function.zip"
        function_name                  = "graph"
        handler                        = "index.handler"
        id                             = "graph"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:graph/invocations"
      ~ last_modified                  = "2020-05-01T14:50:59.011+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 256
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/graph"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "ZA9u/xOBAhLjt/+KnoULZEfoLtJhKNzeMH2dbsO6/j4=" -> "wwQv0zCojx1iYYAE/baPSpJbI8m+9DOvgOS4TUpScJk="
        source_code_size               = 1698627
        tags                           = {}
        timeout                        = 30
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.graph_resolver will be updated in-place
  ~ resource "aws_lambda_function" "graph_resolver" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver"
        filename                       = "./lambda_functions/graph-resolver/function.zip"
        function_name                  = "graph-resolver"
        handler                        = "index.handler"
        id                             = "graph-resolver"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver/invocations"
      ~ last_modified                  = "2020-05-02T08:02:12.212+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 256
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/graph-resolver"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "4766zw6LtpMi6Cfzh++Y24sZLt5110MLqbTjlU8F+C4=" -> "Dns9xYUxSgc/TNJO7HsoAFDpWfmkjH3wCTTiT+cln84="
        source_code_size               = 1082466
        tags                           = {}
        timeout                        = 30
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["accumulation"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/accumulation"
        data_source       = "covidtracker_graph_datasource"
        field             = "accumulation"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-accumulation"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "accumulation",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["ageGenderDistribution"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/ageGenderDistribution"
        data_source       = "covidtracker_graph_datasource"
        field             = "ageGenderDistribution"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-ageGenderDistribution"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "ageGenderDistribution",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["case"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/case"
        data_source       = "covidtracker_graph_datasource"
        field             = "case"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-case"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "case",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["cases"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/cases"
        data_source       = "covidtracker_graph_datasource"
        field             = "cases"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-cases"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "cases",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["statistics"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/statistics"
        data_source       = "covidtracker_graph_datasource"
        field             = "statistics"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-statistics"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "statistics",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

Plan: 1 to add, 11 to change, 1 to destroy.
```

</details>

*Workflow: `Pull Request Action`, Action: `hashicorpterraform-github-actions4`, Working Directory: `core`, Workspace: `default`*
